#+TITLE: MA514 - Numerical Analysis - Spring 2017
- ascher and greif, a first course in numerical methods
* Stability of an Algorithm
  So far, we've defined two types of error.  These errors require that we have the exact answer to the problem, $y$.
  #+begin_definition
    *forward error*
    $\frac{|y - \hat{y}}{|y|}$
    *absolute forward error*
    $|y - \hat{y}$
  #+end_definition

  For some problems, we don't have access to the exact answer, so we instead compute a different kind of error.
  #+begin_definition
  *backward error*
  $\frac{|x - \bar{x}|}{|x|}$
  #+end_definition

  #+begin_examples
  1. $fl(x_1 + x_2) = \[x_1(1 + \delta_1) + x_2(1 + \delta_2)\](1 + \delta_3) \\
      &= x_1(1 + \delta_1)(1 + \delta_3) + x_2(1 + \delta_2)(1 + \delta_3) = \bar{x_1} + \bar{x_2}$
     $\bar{x_1} = x_1(1 + \delta_1)(1 + \delta_3) = x_1 + x_1(\delta_1 + \delta_3) + O(\delta^2) \rightarrow \frac{|\bar{x_1} - x_1|}{x_1} \leq |\delta_1 + \delta_3| = 2 \eta$
  2. Let $y = fl(x_1, x_2) = x_1^2 - x_2^2$ using decimal arith. to 3 digits.  Find the backwards error

     #+begin_src octave
      x1 = 12.5
      x2 = 0.333

      y1 = x1^2
      y2 = x2^2
      y1h = 156 ## round y1 to 3 dig
      y2h = .111 ## round y2 to 3 dig

      y = y1 - y2
      yh = 156 ## round y to 3 dig

      # find d: x1^2 * (1 + d)^2 - x2^2 = yh
      format longe
      y1hat = 156
      y2hat = 1.11e-1
      yhat = y1hat - y2hat
     #+end_src

     #+RESULTS:
  #+end_examples

  #+begin_definition
  *backwards stability*
  An algorithm is backwards stable if the computed $\hat{y}$ satisfies

  $\hat{y} = f(x + \delta)$ where $|\delta| \leq \varepsilon |x|$

  for any $x$ and a sufficiently small $\varepsilon$
  #+end_definition

  #+begin_examples
  
  #+end_examples

  $y_n = \int_0^1 \frac{x^n}{x + 10} dx$ - the thing were trying to calculate

  $y_n + 10y_{n-1} = \frac{1}{n}, n \geq 1$ - the problem
  $y_0 = \ln(11) - \ln(10)$
  
  when we calculate $y_n$ using floating point arithmetic, this is the algorithm

  #+begin_examples
  1.
    #+begin_src octave
    y = zeros(20,1)
    y(1) = ln(11) - ln(10)
    for i=2:20, y(i) = 1/i - 10*y(i-1); end
    #+end_src
  #+end_examples

